#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.docker_key: Refreshing state... [id=76aa0ec98876ea4740e00478413b1ed84b81d1ca]
random_password.docker_password: Refreshing state... [id=none]
data.onepassword_item.gozzi_01_bio_token: Reading...
local_file.docker_key_file: Refreshing state... [id=04209acb364498bfa0d1a750b65c6eb93e2f0ea9]
data.onepassword_item.gozzi_01_bio_token: Read complete after 0s [id=vaults/66qfxcmgwlhutunx6slav6fyve/items/mfukjucb7uuljtldpncj3erlz4]
proxmox_virtual_environment_file.almalinux_8_cloud_image: Refreshing state... [id=local:iso/AlmaLinux-8-GenericCloud-latest.x86_64.img]
proxmox_virtual_environment_file.ubuntu2204_cloud_image: Refreshing state... [id=local:iso/jammy-server-cloudimg-amd64.img]
proxmox_virtual_environment_file.fedora_coreos_cloud_image: Refreshing state... [id=local:iso/fedora-coreos-38.img]
proxmox_virtual_environment_file.ubuntu2004_cloud_image: Refreshing state... [id=local:iso/focal-server-cloudimg-amd64.img]
proxmox_virtual_environment_file.cloud_config: Refreshing state... [id=local:snippets/debian.cloud-config.yaml]
proxmox_virtual_environment_file.debian_cloud_image: Refreshing state... [id=local:iso/debian-11-genericcloud-amd64.img]
proxmox_virtual_environment_vm.docker[0]: Refreshing state... [id=501]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.docker_key_file will be created
  + resource "local_file" "docker_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./docker-ssh.key"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dark-vex, Action: `pull_request`, Working Directory: ``, Workflow: `TF Plan on a PR (BIO)`*